// ***********************************************************************************
// Микроконтроллер: 1986ВЕ92У
// Устройство: Отладочная плата К1986ВЕ92QI
// Файл: rst.h 
// Назначение: Настройка тактирования микроконтроллера
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __U_RST
 #define __U_RST

#include "common.h"

// Инициализация системы тактирования МК
void U_RST_Init(void);


#endif 

