// ***********************************************************************************
// Проект:      Lab3 
// Программа:   Работа с АЦП 
// Микроконтроллер: STM32L152RB
// Устройство: Отладочная плата STM32L-Discovery
// Модуль: port.c 
// Назначение: Настройка портов ввода-вывода
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#include "port.h"

// Структура для инициализации портов ввода-вывода
GPIO_InitTypeDef GPIO_InitStructure;
	
