// ***********************************************************************************
// Проект:      Lab3 
// Программа:   Работа с АЦП 
// Микроконтроллер: STM32L152RB
// Устройство: Отладочная плата STM32L-Discovery
// Модуль: rcc.h 
// Назначение: Настройка тактирования микроконтроллера
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __U_RCC
 #define __U_RCC

#include "stm32l1xx.h"

// Инициализация RCC
void U_RCC_Init(void);


#endif 

