// ***********************************************************************************
// Проект:      Lab2_2 
// Программа:   Работа с кнопкой 
// Микроконтроллер: 1986ВЕ92У
// Файл: button.h 
// Назначение: Управление кнопкой      
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __U_BUTTON
 #define __U_BUTTON

#include "common.h"

// Порт кнопки
#define U_BTN_PORT MDR_PORTB
// Линия для кнопки
#define U_BTN_PIN PORT_Pin_5

// Инициализировать кнопку
void U_BTN_Init (void);

// Получить состояние кнопки
uint8_t U_BTN_Read_Button (void);


#endif 

