// ***********************************************************************************
// Микроконтроллер: 1986ВЕ92У
// Устройство: Отладочная плата К1986ВЕ92QI
// Файл: lсd.c 
// Назначение: Вывод информации на ЖКИ      
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************
#include "lcd.h"

// Задача по выводу бегущей строки на ЖКИ
__task void U_LCD_Task_Function (void)
{
	uint32_t k = 0;
	
	// Строка, выводимая на индикатор 
	const char s[] =  "\xD0\xC3\xD0\xD2\xD3";          // РГРТУ - строка короче индикатора
	//const char s[] =  "ABCDEFGHIJKLMNOPQRSTUVWXYZ "; // строка длиннее индикатора
	
	while(1)
	{
		// Пауза в тиках системного таймера. Здесь 1тик = 1мс. 
    os_dly_wait (1000);  
		
		// Вывести строку c прокруткой
		U_MLT_Scroll_String (s, 4, k++);
		
	}
}
