// ***********************************************************************************
// Проект:      Lab3 
// Программа:   Работа с АЦП 
// Микроконтроллер: STM32L152RB
// Устройство: Отладочная плата STM32L-Discovery
// Модуль: port.h 
// Назначение: Настройка портов ввода-вывода
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __U_PORT
 #define __U_PORT

#include "stm32l1xx.h"

// Структура для инициализации портов ввода-вывода
extern GPIO_InitTypeDef GPIO_InitStructure;


#endif 


