// ***********************************************************************************
// Микроконтроллер: 1986ВЕ92У
// Устройство: Отладочная плата К1986ВЕ92QI
// Файл: lcd.h 
// Назначение: Вывод информации на ЖКИ     
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

#ifndef __U_LCD
 #define __U_LCD

#include "common.h"
#include "mlt_lcd.h"

// Задача по выводу информации на ЖКИ
__task void U_LCD_Task_Function (void);

#endif 

