// ***********************************************************************************
// Проект:      Lab1_2 
// Программа:   Работа с ЖКИ 
// Микроконтроллер: 1986ВЕ92У
// Устройство: Отладочная плата К1986ВЕ92QI
// Файл: main.с 
// Назначение: Главный модуль  
// Компилятор:  Armcc 5.03.0.76 из комплекта Keil uVision 4.72.1.0 
// ***********************************************************************************

/*************************************************************************************

  Выполняется вывод бегущей строки на жидкокристаллический индикатор  

***************************************************************************************/

#include "main.h"

// Точка входа
int main (void)
{
  // Инициализация системы тактирования микроконтроллера
  U_RST_Init ();	
	
	// Инициализация ЖКИ
	U_MLT_Init ();

  // Инициализация задач RTX
  os_sys_init (Main_Task_Init);

  return 0;
}

// Инициализация задач RTX
__task void Main_Task_Init (void)
{
	 // Повысить приоритет текущей задачи
   os_tsk_prio_self (100);

   // Создать задачу "Выводить инфомацию на ЖКИ"
   os_tsk_create (U_LCD_Task_Function, 20);
	
	 // Удалить текущую задачу
   os_tsk_delete_self ();
}


	
